###############################################################################
# Created by write_sdc
###############################################################################
current_design core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[0]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[10]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[11]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[12]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[13]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[14]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[15]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[16]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[17]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[18]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[19]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[1]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[20]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[21]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[22]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[23]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[24]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[25]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[26]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[27]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[28]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[29]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[2]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[30]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[31]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[3]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[4]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[5]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[6]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[7]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[8]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {D_xmem[9]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[0]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[10]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[11]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[12]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[13]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[14]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[15]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[16]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[17]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[18]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[19]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[1]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[20]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[21]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[22]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[23]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[24]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[25]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[26]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[27]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[28]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[29]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[2]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[30]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[31]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[32]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[33]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[3]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[4]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[5]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[6]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[7]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[8]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {inst[9]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {reset}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ofifo_valid}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[100]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[101]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[102]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[103]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[104]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[105]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[106]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[107]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[108]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[109]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[110]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[111]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[112]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[113]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[114]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[115]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[116]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[117]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[118]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[119]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[120]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[121]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[122]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[123]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[124]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[125]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[126]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[127]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[20]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[21]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[22]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[23]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[24]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[25]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[26]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[27]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[28]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[29]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[30]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[31]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[32]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[33]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[34]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[35]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[36]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[37]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[38]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[39]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[40]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[41]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[42]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[43]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[44]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[45]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[46]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[47]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[48]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[49]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[50]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[51]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[52]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[53]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[54]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[55]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[56]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[57]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[58]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[59]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[60]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[61]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[62]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[63]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[64]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[65]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[66]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[67]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[68]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[69]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[70]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[71]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[72]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[73]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[74]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[75]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[76]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[77]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[78]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[79]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[80]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[81]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[82]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[83]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[84]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[85]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[86]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[87]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[88]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[89]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[90]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[91]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[92]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[93]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[94]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[95]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[96]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[97]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[98]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[99]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {sfp_out[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
